УчетВУправляющихДляГит1/src/Documents/УПЖКХ_РегистрацияДоговоровДПОИ/УПЖКХ_РегистрацияДоговоровДПОИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УПЖКХ_РегистрацияДоговоровДПОИ</name>
  <registerRecords>InformationRegister.УПЖКХ_СведенияОДоговорахДПОИ</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.УПЖКХ_ВидыОперацийУчетаДоговоровДПОИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорДПОИ</name>
    <type>
      <types>CatalogRef.УПЖКХ_ДоговорыДПОИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеРасторженияДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/УПЖКХ_РегистрацияДоговоровДПОИ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Проведение

// Функция возвращает параметры проведения.
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ = Ложь) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УПЖКХ_РегистрацияДоговоровДПОИ.Ссылка,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.Номер,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.Дата,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.ВидОперации,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.ДатаНачалаДействия,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.ПланируемаяДатаОкончанияДействия,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.ДоговорДПОИ,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.ОснованиеРасторженияДоговора,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.Ответственный,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.Комментарий,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.ДоговорДПОИ.УправляющаяОрганизация КАК Организация,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.ДоговорДПОИ.Здание КАК Здание,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.ДоговорДПОИ.Арендатор КАК Арендатор,
	|	УПЖКХ_РегистрацияДоговоровДПОИ.ДоговорДПОИ.Наименование КАК НаименованиеДоговорДПОИ
	|ИЗ
	|	Документ.УПЖКХ_РегистрацияДоговоровДПОИ КАК УПЖКХ_РегистрацияДоговоровДПОИ
	|ГДЕ
	|	УПЖКХ_РегистрацияДоговоровДПОИ.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("Ссылка, Номер, Дата, ВидОперации, ДатаНачалаДействия, ПланируемаяДатаОкончанияДействия, ДоговорДПОИ, НаименованиеДоговорДПОИ,
								 |ОснованиеРасторженияДоговора, Ответственный, Комментарий, Организация, Здание, Арендатор");
								 
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Возврат ПараметрыПроведения;
	
КонецФункции // ПодготовитьПараметрыПроведения()

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
